In [1]:
import pandas as pd
import numpy as np

In [2]:
store = pd.HDFStore('model_data.h5')

In [5]:
households = store['households']

In [6]:
households.index.name = 'household_id'
households_reset = households.reset_index()
households_reset.head()

,household_id,serialno,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
0,1,2.012001e+12,1,1,110000,1,53,1,0,1,0,170310101001003
1,2,2.012001e+12,1,1,100000,1,49,1,0,1,0,170310101001000
2,3,2.009000e+12,6,3,130000,2,37,2,4,1,0,170310101001000
3,4,2.012000e+12,2,1,129130,1,62,2,0,1,0,170310101001003
4,5,2.013001e+12,2,1,105000,1,32,2,0,2,0,170310101001003

In [7]:
persons = store["persons"]
persons_reset = persons.reset_index()
persons_reset.head()

,b'person_id',age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,work_at_home,worker
0,1,61,28000,21,40,169,1,1,0,2,0,0,1
1,2,61,0,13,0,101,1,1,0,2,0,0,0
2,3,63,0,22,0,125,1,1,0,2,0,0,0
3,4,63,0,22,0,126,1,1,0,2,0,0,0
4,5,63,0,22,0,127,1,1,0,2,0,0,0

In [8]:
persons_and_households = pd.merge(persons, households, how="inner", left_on="household_id", right_on="household_id")
persons_and_households.head()

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
0,61,28000,21,40,169,1,1,0,2,0,...,1,1,28000,1,61,1,0,1,0,170310101001000
1,61,0,13,0,101,1,1,0,2,0,...,1,0,8270,1,61,0,0,2,0,170310101001003
2,63,0,22,0,125,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001000
3,63,0,22,0,126,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001003
4,63,0,22,0,127,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001000

In [24]:
income_data = {}
income_data["block_id"] = []
for blk_id, df in (persons_and_households.head(20).groupby(["block_id", "household_id"])): 
    income_data["block_id"].append(df["block_id"])            
    display(df)

income_data.values()

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
15,62,0,19,0,109,1,1,0,2,0,...,1,0,14160,1,62,0,0,2,1,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
2,63,0,22,0,125,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
4,63,0,22,0,127,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
9,61,10800,18,20,165,1,1,0,2,0,...,1,1,10800,1,61,1,0,1,0,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
0,61,28000,21,40,169,1,1,0,2,0,...,1,1,28000,1,61,1,0,1,0,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
17,63,14000,21,40,170,1,1,0,2,0,...,1,1,14000,1,63,1,0,1,0,170310101001000

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
11,62,0,16,0,218,1,1,0,2,0,...,1,1,39900,1,62,0,0,1,0,170310101001002

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
5,61,91000,17,80,4,2,1,1,2,0,...,2,1,129130,1,62,2,0,1,0,170310101001003
6,62,38100,21,80,4,1,1,0,1,0,...,2,1,129130,1,62,2,0,1,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
13,62,0,16,0,99,1,1,0,2,0,...,1,0,11200,1,62,0,0,2,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
1,61,0,13,0,101,1,1,0,2,0,...,1,0,8270,1,61,0,0,2,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
14,62,0,16,0,104,1,1,0,2,0,...,1,0,11200,1,62,0,0,2,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
3,63,0,22,0,126,1,1,0,2,0,...,1,1,7800,1,63,0,0,2,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
16,61,18000,18,48,155,1,1,0,2,0,...,1,0,18000,1,61,1,0,2,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
10,61,10800,18,20,171,1,1,0,2,0,...,1,1,10800,1,61,1,0,1,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
18,63,17300,19,35,266,2,1,12,2,0,...,2,1,59400,1,53,2,0,1,0,170310101001003
19,53,42100,19,45,266,1,1,0,2,1,...,2,1,59400,1,53,2,0,1,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
7,62,70000,22,35,293,1,1,0,2,0,...,1,1,82000,1,62,1,0,1,0,170310101001003

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
12,62,0,16,0,97,1,1,0,2,0,...,1,0,11200,1,62,0,0,2,0,170310817001012

,age,earning,edu,hours,household_id,member_id,race_id,relate,sex,student,...,persons,cars,income,race_of_head,age_of_head,workers,children,tenure,recent_mover,block_id
8,63,0,21,0,240,1,1,0,2,0,...,1,1,44000,1,63,0,0,2,0,170898524034017

dict_values([[15    170310101001000
Name: block_id, dtype: object, 2    170310101001000
Name: block_id, dtype: object, 4    170310101001000
Name: block_id, dtype: object, 9    170310101001000
Name: block_id, dtype: object, 0    170310101001000
Name: block_id, dtype: object, 17    170310101001000
Name: block_id, dtype: object, 11    170310101001002
Name: block_id, dtype: object, 5    170310101001003
6    170310101001003
Name: block_id, dtype: object, 13    170310101001003
Name: block_id, dtype: object, 1    170310101001003
Name: block_id, dtype: object, 14    170310101001003
Name: block_id, dtype: object, 3    170310101001003
Name: block_id, dtype: object, 16    170310101001003
Name: block_id, dtype: object, 10    170310101001003
Name: block_id, dtype: object, 18    170310101001003
19    170310101001003
Name: block_id, dtype: object, 7    170310101001003
Name: block_id, dtype: object, 12    170310817001012
Name: block_id, dtype: object, 8    170898524034017
Name: block_id, dtype: object]])

In [ ]:
studentData = {
    'block_id' : ['jack', 'Riti', 'Aadi'],
    'hh_less20' : [34, 30, 16],
    'hh_20to35K' : ['Sydney', 'Delhi', 'New york'],
    'hh_35to50K' : ['Sydney', 'Delhi', 'New york'],
    'hh_50to75K' : ['Sydney', 'Delhi', 'New york'],
    'hh_75to100K' : ['Sydney', 'Delhi', 'New york'],
    'hh_100to150K' : ['Sydney', 'Delhi', 'New york'],
    'hh_over150K' : ['Sydney', 'Delhi', 'New york'],
}